import React from 'react';
import {
    Container,
    Separator,
    Content, Text,
} from 'native-base';
import AppHeader from '../header';
export default class Rules extends React.Component {

    render() {
        return (
            <Container>
                <AppHeader rightTitle="قوانین و تعهدات" backButton="flex"/>
                <Content padder>
                    <Separator>
                        <Text style={{textAlign:'center',fontSize:30}}>
                            قوانین
                        </Text>
                    </Separator>
                    <Text>
                        1-هر شخص (اعم از حقیقی و حقوقی) تنها مجاز به افتتاح یک حساب کاربری در سلفیت است.
                    </Text>
                    <Text>
                        2-استفاده از محتوای موجود در سلفیت تنها برای مقاصد غیرتجاری و با ذکر منبع ممکن است
                    </Text>
                    <Text>
                        3-هر کاربر مسئولیت صحت اطلاعات مندرج در حساب کاربری را می‌‌پذیرد و متعهد می‌‌شود که در صورت
                        تغییر در
                        هر بخش از این اطلاعات، حساب کاربری خود را در سلفیت به‌روز نماید.
                    </Text>
                    <Text>
                        4-کاربر موظف است در زمان تحویل کالا یا مواد غذایی، تعداد و نوع غذاهای دریافتی را کنترل نماید و
                        در
                        صورت هر گونه مغایرت، در حضور پیک سلفیت تماس بگیرد.
                    </Text>
                    <Text>
                        5- توجه داشته باشید کلیه اصول و رویه‏‌های سلفیت منطبق با قوانین جمهوری اسلامی ایران، قانون تجارت
                        الکترونیک و قانون حمایت از حقوق مصرف کننده است و متعاقبا کاربر نیز موظف به رعایت قوانین مرتبط با
                        کاربر است. در صورتی که در قوانین مندرج، رویه‏‌ها و سرویس‏‌های سلفیت تغییراتی در آینده ایجاد شود،
                        در
                        همین صفحه منتشر و به روز رسانی می شود و شما توافق می‏‌کنید که استفاده مستمر شما از سایت به معنی
                        پذیرش هرگونه تغییر است.
                    </Text>
                    <Text>
                        6-استفاده از نام و نام‌خانوادگی حقیقی افراد به منظور ثبت نام در سایت الزامی است. در صورت مشاهده
                        کلمات رکیک و الفاظ نامناسب، حساب كاربر حذف خواهد شد.
                    </Text>
                    <Text>
                        6-هنگام سفارش ، ثبت یک شماره معتبر و قابل دسترس برای کاربران الزامی است.
                    </Text>
                    <Text>
                        7-مسئولیت وارد کردن اطلاعات اشتباه و غیر واقعی از قبیل نام و نام خانوادگی، آدرس و شماره تماس به
                        عهده
                        کاربر است.
                    </Text>
                    <Text>
                        8-با وجود آن‌که تمام سعی سلفیت بر همکاری با بهترین و معتبرترین باشگاها است،سلفیت در این زنجیره
                        تنها
                        نماینده‌ای برای برقراری ارتباط بهینه و موثر میان کاربران و باشگاههای سراسر ایران است و لذا
                        مسئولیتی
                        در قبال کیفیت خدمات و نحوه ارسال سفارشات عهده‌دار نیست.
                    </Text>
                    <Text>
                        9-تمامی متن‌ها، طرح‌های گرافیکی و کدهای به کار گرفته شده در سلفیت جزو اموال شرکت «ایده گزین
                        تندرستی»
                        محسوب شده و هرگونه کپی برداری، نشر، نمایش، بازسازی و انتقال آن به هر صورت بدون اجازه مالک ممنوع
                        بوده
                        و پیگرد قانونی در پی خواهد داشت.
                    </Text>
                </Content>
            </Container>
        )
    }
}

